RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
    status = caam_aes_ccm_check_input_args(base, input, iv, key, output, size, ivSize, aadSize, keySize, tagSize);
    if (status != kStatus_Success)
    {
        return status;
    }

    /* add descriptor size */
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);

    /* key address and key size */
    descriptor[1] |= (keySize & DESC_KEY_SIZE_MASK);
    descriptor[2] = ADD_OFFSET((uint32_t)key);

    /* B0 and CTR0 */
    caam_aes_ccm_context_init(size, iv, ivSize, aadSize, tagSize, &descriptor[4], &descriptor[9]);

    /* Encrypt decrypt */
    if (encrypt != 0)
    {
        descriptor[13] |= 1u; /* ENC */
    }
    else if (tag != 0U)
    {
        /* If we decrypt message with tag, then desc[18] is not last FIFO LOAD because FIFO LOAD is used for TAG */
        /* So desc[18] is changed from 0x22530000u to 0x22510000u*/
        descriptor[18] = 0x22510000u;
        descriptor[13] |= 2u; /* ICV_TEST */
    }
    else
    {
        /* decrypt with tag NULL (skip tag processing). nothing needs to be changed in descriptor[13] for this case */
    }

    /* AAD address and size */
    /* encoding is two octets, msbyte first */
    if (aadSize != 0U)
    {
        uint32_t swapped = swap_bytes(aadSize);
        uint32_t sz;
        (void)caam_memcpy(&descriptor[15], (uint32_t *)(uintptr_t)(((uint8_t *)&swapped) + sizeof(uint16_t)),
                          sizeof(uint16_t));
        sz = aadSize > 2u ? 2u : aadSize;                             /* limit aad to the end of 16 bytes blk */
        (void)caam_memcpy(((uint8_t *)&descriptor[15]) + 2, aad, sz); /* fill B1 with aad */
        /* track consumed AAD. sz bytes have been moved to fifo. */
        aadSize -= sz;
        aad += sz;

        if (aadSize == 0U)
        {
            /* in case aadSize is 1 or 2, we add Flush bit to the command and skip FIFO LOAD AAD */
            descriptor[14] |= 0x00010000U; /* Flush (last AAD data) */
            descriptor[16] = DESC_JUMP_2;  /* jump to current index + 2 (=18) */
        }
        else
        {
            descriptor[16] |= (aadSize & DESC_PAYLOAD_SIZE_MASK);
            descriptor[17] = ADD_OFFSET((uint32_t)aad);
        }
    }
    else
    {
        /* no AAD, jump directly to message */
        descriptor[14] = DESC_JUMP_4; /* jump to current index + 4 (=18) */
    }

    /* Message source address and size */
    descriptor[19] = ADD_OFFSET((uint32_t)input);
    descriptor[20] = size;

    /* Message destination address and size */
    descriptor[22] = ADD_OFFSET((uint32_t)output);
    descriptor[23] = size;

    if (tag != 0U)
    {
        /* For decryption change the command to FIFO LOAD, as tag data needs to be put into input FIFO */
        if (encrypt == 0)
        {
            /* FIFO LOAD ICV */
            descriptor[24] = 0x223B0000u;
        }
        descriptor[24] |= (tagSize & DESC_TAG_SIZE_MASK);
        descriptor[25] = ADD_OFFSET((uint32_t)tag);
    }
    else
    {
        /* tag is NULL, skip tag processing */
        descriptor[24] = DESC_HALT; /* always halt with status 0x0 (normal) */
    }

    return kStatus_Success;
}

status_t caam_aes_ccm_non_blocking(CAAM_Type *base,
                                   caam_handle_t *handle,
                                   caam_desc_aes_ccm_t descriptor,
                                   const uint8_t *input,
                                   uint8_t *output,
                                   size_t size,
                                   const uint8_t *iv,
                                   size_t ivSize,
                                   const uint8_t *aad,
                                   size_t aadSize,
                                   const uint8_t *key,
                                   size_t keySize,
                                   uint32_t tag,
                                   size_t tagSize,
                                   int encrypt);

status_t caam_aes_ccm_non_blocking(CAAM_Type *base,
                                   caam_handle_t *handle,
                                   caam_desc_aes_ccm_t descriptor,
                                   const uint8_t *input,
                                   uint8_t *output,
                                   size_t size,
                                   const uint8_t *iv,
                                   size_t ivSize,
                                   const uint8_t *aad,
                                   size_t aadSize,
                                   const uint8_t *key,
                                   size_t keySize,
                                   uint32_t tag,
                                   size_t tagSize,
                                   int encrypt)
{
    status_t status = s_caam_aes_ccm_non_blocking(base, handle, descriptor, input, output, size, iv, ivSize, aad,
                                                  aadSize, key, keySize, tag, tagSize, encrypt);
    if (status == kStatus_Success)
    {
        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

status_t caam_aes_ccm_non_blocking_extended(CAAM_Type *base,
                                            caam_handle_t *handle,
                                            caam_desc_aes_ccm_t descriptor,
                                            const uint8_t *input,
                                            uint8_t *output,
                                            size_t size,
                                            const uint8_t *iv,
                                            size_t ivSize,
                                            const uint8_t *aad,
                                            size_t aadSize,
                                            const uint8_t *key,
                                            size_t keySize,
                                            uint32_t tag,
                                            size_t tagSize,
                                            int encrypt,
                                            caam_key_type_t blackKeyType);

status_t caam_aes_ccm_non_blocking_extended(CAAM_Type *base,
                                            caam_handle_t *handle,
                                            caam_desc_aes_ccm_t descriptor,
                                            const uint8_t *input,
                                            uint8_t *output,
                                            size_t size,
                                            const uint8_t *iv,
                                            size_t ivSize,
                                            const uint8_t *aad,
                                            size_t aadSize,
                                            const uint8_t *key,
                                            size_t keySize,
                                            uint32_t tag,
                                            size_t tagSize,
                                            int encrypt,
                                            caam_key_type_t blackKeyType)
{
    status_t status = s_caam_aes_ccm_non_blocking(base, handle, descriptor, input, output, size, iv, ivSize, aad,
                                                  aadSize, key, keySize, tag, tagSize, encrypt);

    if (status == kStatus_Success)
    {
        descriptor[1] |= (uint32_t)blackKeyType;

        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

/*!
 * brief Encrypts AES and tags using CCM block mode.
 *
 * Puts AES CCM encrypt and tag descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param plaintext Input plain text to encrypt
 * param[out] ciphertext Output cipher text.
 * param size Size of input and output data in bytes. Zero means authentication only.
 * param iv Nonce
 * param ivSize Length of the Nonce in bytes. Must be 7, 8, 9, 10, 11, 12, or 13.
 * param aad Input additional authentication data. Can be NULL if aadSize is zero.
 * param aadSize Input size in bytes of AAD. Zero means data mode only (authentication skipped).
 * param key Input key to use for encryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param[out] tag Generated output tag. Set to NULL to skip tag processing.
 * param tagSize Input size of the tag to generate, in bytes. Must be 4, 6, 8, 10, 12, 14, or 16.
 * return Status from job descriptor push
 */
status_t CAAM_AES_EncryptTagCcmNonBlocking(CAAM_Type *base,
                                           caam_handle_t *handle,
                                           caam_desc_aes_ccm_t descriptor,
                                           const uint8_t *plaintext,
                                           uint8_t *ciphertext,
                                           size_t size,
                                           const uint8_t *iv,
                                           size_t ivSize,
                                           const uint8_t *aad,
                                           size_t aadSize,
                                           const uint8_t *key,
                                           size_t keySize,
                                           uint8_t *tag,
                                           size_t tagSize)
{
    return caam_aes_ccm_non_blocking(base, handle, descriptor, plaintext, ciphertext, size, iv, ivSize, aad, aadSize,
                                     key, keySize, (uint32_t)tag, tagSize, 1);
}

/*!
 * brief Decrypts AES and authenticates using CCM block mode.
 *
 * Puts AES CCM decrypt and check tag descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param ciphertext Input cipher text to decrypt
 * param[out] plaintext Output plain text.
 * param size Size of input and output data in bytes. Zero means authentication data only.
 * param iv Nonce
 * param ivSize Length of the Nonce in bytes. Must be 7, 8, 9, 10, 11, 12, or 13.
 * param aad Input additional authentication data. Can be NULL if aadSize is zero.
 * param aadSize Input size in bytes of AAD. Zero means data mode only (authentication data skipped).
 * param key Input key to use for decryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param tag Received tag. Set to NULL to skip tag processing.
 * param tagSize Input size of the received tag to compare with the computed tag, in bytes. Must be 4, 6, 8, 10, 12,
 *                14, or 16.
 * return Status from job descriptor push
 */
status_t CAAM_AES_DecryptTagCcmNonBlocking(CAAM_Type *base,
                                           caam_handle_t *handle,
                                           caam_desc_aes_ccm_t descriptor,
                                           const uint8_t *ciphertext,
                                           uint8_t *plaintext,
                                           size_t size,
                                           const uint8_t *iv,
                                           size_t ivSize,
                                           const uint8_t *aad,
                                           size_t aadSize,
                                           const uint8_t *key,
                                           size_t keySize,
                                           const uint8_t *tag,
                                           size_t tagSize)
{
    return caam_aes_ccm_non_blocking(base, handle, descriptor, ciphertext, plaintext, size, iv, ivSize, aad, aadSize,
                                     key, keySize, (uint32_t)tag, tagSize, 0);
}

/*!
 * brief Encrypts AES and tags using CCM block mode.
 *
 * Puts AES CCM encrypt and tag descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param plaintext Input plain text to encrypt
 * param[out] ciphertext Output cipher text.
 * param size Size of input and output data in bytes. Zero means authentication only.
 * param iv Nonce
 * param ivSize Length of the Nonce in bytes. Must be 7, 8, 9, 10, 11, 12, or 13.
 * param aad Input additional authentication data. Can be NULL if aadSize is zero.
 * param aadSize Input size in bytes of AAD. Zero means data mode only (authentication skipped).
 * param key Input key to use for encryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param[out] tag Generated output tag. Set to NULL to skip tag processing.
 * param tagSize Input size of the tag to generate, in bytes. Must be 4, 6, 8, 10, 12, 14, or 16.
 * return Status from job descriptor push
 */
status_t CAAM_AES_EncryptTagCcmNonBlockingExtended(CAAM_Type *base,
                                                   caam_handle_t *handle,
                                                   caam_desc_aes_ccm_t descriptor,
                                                   const uint8_t *plaintext,
                                                   uint8_t *ciphertext,
                                                   size_t size,
                                                   const uint8_t *iv,
                                                   size_t ivSize,
                                                   const uint8_t *aad,
                                                   size_t aadSize,
                                                   const uint8_t *key,
                                                   size_t keySize,
                                                   uint8_t *tag,
                                                   size_t tagSize,
                                                   caam_key_type_t blackKeyType)
{
    return caam_aes_ccm_non_blocking_extended(base, handle, descriptor, plaintext, ciphertext, size, iv, ivSize, aad,
                                              aadSize, key, keySize, (uint32_t)tag, tagSize, 1, blackKeyType);
}

/*!
 * brief Decrypts AES and authenticates using CCM block mode.
 *
 * Puts AES CCM decrypt and check tag descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param ciphertext Input cipher text to decrypt
 * param[out] plaintext Output plain text.
 * param size Size of input and output data in bytes. Zero means authentication data only.
 * param iv Nonce
 * param ivSize Length of the Nonce in bytes. Must be 7, 8, 9, 10, 11, 12, or 13.
 * param aad Input additional authentication data. Can be NULL if aadSize is zero.
 * param aadSize Input size in bytes of AAD. Zero means data mode only (authentication data skipped).
 * param key Input key to use for decryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param tag Received tag. Set to NULL to skip tag processing.
 * param tagSize Input size of the received tag to compare with the computed tag, in bytes. Must be 4, 6, 8, 10, 12,
 *                14, or 16.
 * return Status from job descriptor push
 */
status_t CAAM_AES_DecryptTagCcmNonBlockingExtended(CAAM_Type *base,
                                                   caam_handle_t *handle,
                                                   caam_desc_aes_ccm_t descriptor,
                                                   const uint8_t *ciphertext,
                                                   uint8_t *plaintext,
                                                   size_t size,
                                                   const uint8_t *iv,
                                                   size_t ivSize,
                                                   const uint8_t *aad,
                                                   size_t aadSize,
                                                   const uint8_t *key,
                                                   size_t keySize,
                                                   const uint8_t *tag,
                                                   size_t tagSize,
                                                   caam_key_type_t blackKeyType)
{
    return caam_aes_ccm_non_blocking_extended(base, handle, descriptor, ciphertext, plaintext, size, iv, ivSize, aad,
                                              aadSize, key, keySize, (uint32_t)tag, tagSize, 0, blackKeyType);
}

static const uint32_t templateAesCtr[] = {
    /* 00 */ 0xB0800000u, /* HEADER */
    /* 01 */ 0x02000000u, /* KEY */
    /* 02 */ 0x00000000u, /* place: key address */
    /* 03 */ 0x12201010u, /* LOAD 16 bytes of CTR0 to Class 1 Context Register. Offset 16 bytes. */
    /* 04 */ 0x00000000u, /* place: CTR0 address */

    /* 05 */ 0x82100000u, /* OPERATION: AES CTR (de)crypt in Update mode */
    /* 06 */ 0x22530000u, /* FIFO LOAD Message */
    /* 07 */ 0x00000000u, /* place: source address */
    /* 08 */ 0x00000000u, /* place: source size */
    /* 09 */ 0x60700000u, /* FIFO STORE Message */
    /* 10 */ 0x00000000u, /* place: destination address */
    /* 11 */ 0x00000000u, /* place: destination size */

    /* 12 */ 0xA2000001u, /* JMP always to next command. Done checkpoint (wait for Class 1 Done) */
    /* 13 */ 0x10880004u, /* LOAD Immediate to Clear Written Register. */
    /* 14 */ 0x08000004u, /* value for Clear Written Register: C1D and C1DS bits are set */
    /* 15 */ 0x22930010u, /* FIFO LOAD Message Immediate 16 bytes */
    /* 16 */ 0x00000000u, /* all zeroes 0-3 */

