RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
    /* 17 */ 0x00000000u, /* all zeroes 4-7 */
    /* 18 */ 0x00000000u, /* all zeroes 8-11 */
    /* 19 */ 0x00000000u, /* all zeroes 12-15 */
    /* 20 */ 0x60300010u, /* FIFO STORE Message 16 bytes */
    /* 21 */ 0x00000000u, /* place: counterlast[] block address */

    /* 22 */ 0x82100000u, /* OPERATION: AES CTR (de)crypt in Update mode */
    /* 23 */ 0x52201010u, /* STORE 16 bytes of CTRi from Class 1 Context Register offset 16 bytes. */
    /* 24 */ 0x00000000u, /* place: CTRi address */
};

/*!
 * brief Encrypts or decrypts AES using CTR block mode.
 *
 * Encrypts or decrypts AES using CTR block mode.
 * AES CTR mode uses only forward AES cipher and same algorithm for encryption and decryption.
 * The only difference between encryption and decryption is that, for encryption, the input argument
 * is plain text and the output argument is cipher text. For decryption, the input argument is cipher text
 * and the output argument is plain text.
 *
 * Puts AES CTR crypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param input Input data for CTR block mode
 * param[out] output Output data for CTR block mode
 * param size Size of input and output data in bytes
 * param[in,out] counter Input counter (updates on return)
 * param key Input key to use for forward AES cipher
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param[out] counterlast Output cipher of last counter, for chained CTR calls. NULL can be passed if chained calls are
 * not used.
 * param[out] szLeft Output number of bytes in left unused in counterlast block. NULL can be passed if chained calls
 * are not used.
 * return Status from job descriptor push
 */
static status_t s_CAAM_AES_CryptCtrNonBlocking(CAAM_Type *base,
                                        caam_handle_t *handle,
                                        caam_desc_aes_ctr_t descriptor,
                                        const uint8_t *input,
                                        uint8_t *output,
                                        size_t size,
                                        uint8_t *counter,
                                        const uint8_t *key,
                                        size_t keySize,
                                        uint8_t *counterlast,
                                        size_t *szLeft)
{
    BUILD_ASSURE(sizeof(templateAesCtr) <= sizeof(caam_desc_aes_ctr_t), caam_desc_aes_ctr_t_size);
    uint32_t descriptorSize;

    if (!caam_check_key_size(keySize))
    {
        return kStatus_InvalidArgument;
    }

    /* get template descriptor and it's size */
    descriptorSize = ARRAY_SIZE(templateAesCtr);
    (void)caam_memcpy(descriptor, templateAesCtr, sizeof(templateAesCtr));

    /* add descriptor size */
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);

    /* key address and key size */
    descriptor[1] |= (keySize & DESC_KEY_SIZE_MASK);
    descriptor[2] = ADD_OFFSET((uint32_t)key);

    /* descriptor[3] configures 16 bytes length for CTR0 in templateAesCtr */
    descriptor[4] = ADD_OFFSET((uint32_t)counter);

    /* source address and size */
    descriptor[7] = ADD_OFFSET((uint32_t)input);
    descriptor[8] = size;

    /* destination address and size */
    descriptor[10] = ADD_OFFSET((uint32_t)output);
    descriptor[11] = size;

    /* AES CTR Crypt OPERATION in descriptor[5]
     * Algorithm State (AS) in template is Update (0h)
     * Only in case we are chaining the AES CTR calls (counterlast[] != NULL),
     * we have to change the algorithm state to Finalize (2h)
     * and so the CTRi for the last message block is not written to Class 1 Context.
     * This allows us to repeat AES CTR of the last CTRi, with destination to counterlast[],
     * and with using all zeroes in message data, the counterlast[] gets ECB of the last CTRi.
     */

    /* if counterlast or szLeft is NULL, the caller is not interested in AES of last counter
     * Thus, we can skip the counterlast processing
     * and only read the last CTRi from context.
     * So, we replace descriptor[11] with a jump command to STORE
     */
    if ((counterlast == NULL) || (szLeft == NULL))
    {
        /*  To create an unconditional jump, use TEST TYPE = 00 (all specified conditions true) and
            clear all TEST CONDITION bits because the tested condition is considered to be true if
            no test condition bits are set. */
        descriptor[12] = 0xA000000Bu; /* jump to current index + 11 (=23) */
    }
    else
    {
        uint32_t lastSize;

        descriptor[5] |= 0x08u; /* finalize */
        descriptor[21] = ADD_OFFSET((uint32_t)counterlast);

        lastSize = size % 16u;
        if (lastSize != 0U)
        {
            *szLeft = 16u - lastSize;
        }
        else
        {
            *szLeft = 0;
            /* descriptor[12] = 0xA000000Bu; */ /* jump to current index + 11 (=23) */
        }
    }

    /* read last CTRi from AES back to caller */
    descriptor[24] = ADD_OFFSET((uint32_t)counter);

    return kStatus_Success;
}

/*!
 * brief Encrypts or decrypts AES using CTR block mode.
 *
 * Encrypts or decrypts AES using CTR block mode.
 * AES CTR mode uses only forward AES cipher and same algorithm for encryption and decryption.
 * The only difference between encryption and decryption is that, for encryption, the input argument
 * is plain text and the output argument is cipher text. For decryption, the input argument is cipher text
 * and the output argument is plain text.
 *
 * Puts AES CTR crypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param input Input data for CTR block mode
 * param[out] output Output data for CTR block mode
 * param size Size of input and output data in bytes
 * param[in,out] counter Input counter (updates on return)
 * param key Input key to use for forward AES cipher
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param[out] counterlast Output cipher of last counter, for chained CTR calls. NULL can be passed if chained calls are
 * not used.
 * param[out] szLeft Output number of bytes in left unused in counterlast block. NULL can be passed if chained calls
 * are not used.
 * return Status from job descriptor push
 */
status_t CAAM_AES_CryptCtrNonBlocking(CAAM_Type *base,
                                      caam_handle_t *handle,
                                      caam_desc_aes_ctr_t descriptor,
                                      const uint8_t *input,
                                      uint8_t *output,
                                      size_t size,
                                      uint8_t *counter,
                                      const uint8_t *key,
                                      size_t keySize,
                                      uint8_t *counterlast,
                                      size_t *szLeft)
{
    status_t status = s_CAAM_AES_CryptCtrNonBlocking(base, handle, descriptor, input, output, size, counter, key,
                                                     keySize, counterlast, szLeft);

    if (status == kStatus_Success)
    {
        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

/*!
 * brief Encrypts or decrypts AES using CTR block mode using black key.
 *
 * Encrypts or decrypts AES using CTR block mode.
 * AES CTR mode uses only forward AES cipher and same algorithm for encryption and decryption.
 * The only difference between encryption and decryption is that, for encryption, the input argument
 * is plain text and the output argument is cipher text. For decryption, the input argument is cipher text
 * and the output argument is plain text.
 *
 * Puts AES CTR crypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param input Input data for CTR block mode
 * param[out] output Output data for CTR block mode
 * param size Size of input and output data in bytes
 * param[in,out] counter Input counter (updates on return)
 * param key Input key to use for forward AES cipher
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param[out] counterlast Output cipher of last counter, for chained CTR calls. NULL can be passed if chained calls are
 * not used.
 * param[out] szLeft Output number of bytes in left unused in counterlast block. NULL can be passed if chained calls
 * are not used.
 * param blackKeyType Type of black key
 * return Status from job descriptor push
 */
status_t CAAM_AES_CryptCtrNonBlockingExtended(CAAM_Type *base,
                                              caam_handle_t *handle,
                                              caam_desc_aes_ctr_t descriptor,
                                              const uint8_t *input,
                                              uint8_t *output,
                                              size_t size,
                                              uint8_t *counter,
                                              const uint8_t *key,
                                              size_t keySize,
                                              uint8_t *counterlast,
                                              size_t *szLeft,
                                              caam_key_type_t blackKeyType)
{
    status_t status = s_CAAM_AES_CryptCtrNonBlocking(base, handle, descriptor, input, output, size, counter, key,
                                                     keySize, counterlast, szLeft);

    if (status == kStatus_Success)
    {
        descriptor[1] |= (uint32_t)blackKeyType;

        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

