RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
static const uint32_t templateAesEcb[] = {
    /* 00 */ 0xB0800000u, /* HEADER */
    /* 01 */ 0x02000000u, /* KEY */
    /* 02 */ 0x00000000u, /* place: key address */
    /* 03 */ 0x22530000u, /* FIFO LOAD Message with EXT size */
    /* 04 */ 0x00000000u, /* place: source address */
    /* 05 */ 0x00000000u, /* place: source size */
    /* 06 */ 0x60700000u, /* FIFO STORE Message with EXT size */
    /* 07 */ 0x00000000u, /* place: destination address */
    /* 08 */ 0x00000000u, /* place: destination size */
    /* 09 */ 0x82100200u, /* OPERATION: AES ECB Decrypt */
};

/*!
 * brief Encrypts AES using the ECB block mode.
 *
 * Puts AES ECB encrypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param plaintext Input plain text to encrypt
 * param[out] descriptor Memory for the CAAM descriptor.
 * param[out] ciphertext Output cipher text
 * param size Size of input and output data in bytes. Must be multiple of 16 bytes.
 * param key Input key to use for encryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * return Status from job descriptor push
 */
static status_t s_CAAM_AES_EncryptEcbNonBlocking(CAAM_Type *base,
                                          caam_handle_t *handle,
                                          caam_desc_aes_ecb_t descriptor,
                                          const uint8_t *plaintext,
                                          uint8_t *ciphertext,
                                          size_t size,
                                          const uint8_t *key,
                                          size_t keySize)
{
    BUILD_ASSURE(sizeof(templateAesEcb) <= sizeof(caam_desc_aes_ecb_t), caam_desc_aes_ecb_t_size);
    uint32_t descriptorSize;

    if (!caam_check_key_size(keySize))
    {
        return kStatus_InvalidArgument;
    }
    /* ECB mode, size must be non-zero 16-byte multiple */
    if (0U != (size % 16u))
    {
        return kStatus_InvalidArgument;
    }

    descriptorSize = ARRAY_SIZE(templateAesEcb);
    (void)caam_memcpy(descriptor, templateAesEcb, sizeof(templateAesEcb));
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= (keySize & DESC_KEY_SIZE_MASK);
    descriptor[2] = (uint32_t)ADD_OFFSET((uint32_t)key);
    /* descriptor[3] FIFO LOAD copied from template */
    descriptor[4] = (uint32_t)ADD_OFFSET((uint32_t)plaintext);
    descriptor[5] = size; /* FIFO LOAD EXT size */
                          /* descriptor[6] FIFO STORE copied from template */
    descriptor[7] = (uint32_t)ADD_OFFSET((uint32_t)ciphertext);
    descriptor[8] = size; /* FIFO STORE EXT size */
    descriptor[9] |= 1u;  /* add ENC bit to specify Encrypt OPERATION */

    return kStatus_Success;
}

/*!
 * brief Encrypts AES using the ECB block mode.
 *
 * Puts AES ECB encrypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param plaintext Input plain text to encrypt
 * param[out] descriptor Memory for the CAAM descriptor.
 * param[out] ciphertext Output cipher text
 * param size Size of input and output data in bytes. Must be multiple of 16 bytes.
 * param key Input key to use for encryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * return Status from job descriptor push
 */
status_t CAAM_AES_EncryptEcbNonBlocking(CAAM_Type *base,
                                        caam_handle_t *handle,
                                        caam_desc_aes_ecb_t descriptor,
                                        const uint8_t *plaintext,
                                        uint8_t *ciphertext,
                                        size_t size,
                                        const uint8_t *key,
                                        size_t keySize)
{
    status_t status =
        s_CAAM_AES_EncryptEcbNonBlocking(base, handle, descriptor, plaintext, ciphertext, size, key, keySize);

    if (status == kStatus_Success)
    {
        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

/*!
 * brief Decrypts AES using ECB block mode.
 *
 * Puts AES ECB decrypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param ciphertext Input cipher text to decrypt
 * param[out] plaintext Output plain text
 * param size Size of input and output data in bytes. Must be multiple of 16 bytes.
 * param key Input key.
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * return Status from job descriptor push
 */
static status_t s_CAAM_AES_DecryptEcbNonBlocking(CAAM_Type *base,
                                          caam_handle_t *handle,
                                          caam_desc_aes_ecb_t descriptor,
                                          const uint8_t *ciphertext,
                                          uint8_t *plaintext,
                                          size_t size,
                                          const uint8_t *key,
                                          size_t keySize)
{
    uint32_t descriptorSize;

    if (!caam_check_key_size(keySize))
    {
        return kStatus_InvalidArgument;
    }
    /* ECB mode, size must be non-zero 16-byte multiple */
    if (0U != (size % 16u))
    {
        return kStatus_InvalidArgument;
    }

    descriptorSize = ARRAY_SIZE(templateAesEcb);
    (void)caam_memcpy(descriptor, templateAesEcb, sizeof(templateAesEcb));
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= (keySize & DESC_KEY_SIZE_MASK);
    descriptor[2] = (uint32_t)ADD_OFFSET((uint32_t)key);
    /* descriptor[3] FIFO LOAD copied from template */
    descriptor[4] = (uint32_t)ADD_OFFSET((uint32_t)ciphertext);
    descriptor[5] = size;
    /* descriptor[6] FIFO STORE copied from template */
    descriptor[7] = (uint32_t)ADD_OFFSET((uint32_t)plaintext);
    descriptor[8] = size; /* FIFO STORE EXT size */

    return kStatus_Success;
}

/*!
 * brief Decrypts AES using ECB block mode.
 *
 * Puts AES ECB decrypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param ciphertext Input cipher text to decrypt
 * param[out] plaintext Output plain text
 * param size Size of input and output data in bytes. Must be multiple of 16 bytes.
 * param key Input key.
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * return Status from job descriptor push
 */
status_t CAAM_AES_DecryptEcbNonBlocking(CAAM_Type *base,
                                        caam_handle_t *handle,
                                        caam_desc_aes_ecb_t descriptor,
                                        const uint8_t *ciphertext,
                                        uint8_t *plaintext,
                                        size_t size,
                                        const uint8_t *key,
                                        size_t keySize)
{
    status_t status =
        s_CAAM_AES_DecryptEcbNonBlocking(base, handle, descriptor, ciphertext, plaintext, size, key, keySize);

    if (status == kStatus_Success)
    {
        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

/*!
 * brief Encrypts AES using the ECB block mode using black key.
 *
 * Puts AES ECB encrypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param plaintext Input plain text to encrypt
 * param[out] descriptor Memory for the CAAM descriptor.
 * param[out] ciphertext Output cipher text
 * param size Size of input and output data in bytes. Must be multiple of 16 bytes.
 * param key Input key to use for encryption
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param blackKeyType Type of black key
 * return Status from job descriptor push
 */
status_t CAAM_AES_EncryptEcbNonBlockingExtended(CAAM_Type *base,
                                                caam_handle_t *handle,
                                                caam_desc_aes_ecb_t descriptor,
                                                const uint8_t *plaintext,
                                                uint8_t *ciphertext,
                                                size_t size,
                                                const uint8_t *key,
                                                size_t keySize,
                                                caam_key_type_t blackKeyType)
{
    status_t status =
        s_CAAM_AES_EncryptEcbNonBlocking(base, handle, descriptor, plaintext, ciphertext, size, key, keySize);

    if (status == kStatus_Success)
    {
        descriptor[1] |= (uint32_t)blackKeyType;

        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

/*!
 * brief Decrypts AES using ECB block mode using black key.
 *
 * Puts AES ECB decrypt descriptor to CAAM input job ring.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param ciphertext Input cipher text to decrypt
 * param[out] plaintext Output plain text
 * param size Size of input and output data in bytes. Must be multiple of 16 bytes.
 * param key Input key.
 * param keySize Size of the input key, in bytes. Must be 16, 24, or 32.
 * param blackKeyType Type of black key
 * return Status from job descriptor push
 */
status_t CAAM_AES_DecryptEcbNonBlockingExtended(CAAM_Type *base,
                                                caam_handle_t *handle,
                                                caam_desc_aes_ecb_t descriptor,
                                                const uint8_t *ciphertext,
                                                uint8_t *plaintext,
                                                size_t size,
                                                const uint8_t *key,
                                                size_t keySize,
                                                caam_key_type_t blackKeyType)
{
    status_t status =
        s_CAAM_AES_DecryptEcbNonBlocking(base, handle, descriptor, ciphertext, plaintext, size, key, keySize);

    if (status == kStatus_Success)
    {
        descriptor[1] |= (uint32_t)blackKeyType;

        /* add operation specified by descriptor to CAAM Job Ring */
        return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    }
    else
    {
        return status;
    }
}

