RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
static uint32_t caam_hash_algo2mode(caam_hash_algo_t algo, uint32_t algState, uint32_t *algOutSize)
{
    uint32_t modeReg  = 0u;
    uint32_t outSize  = 0u;
    uint32_t HmacMode = 0u;

    if (((algState >> 2u) == (uint32_t)kCAAM_AlgStateInit) || ((algState >> 2u) == (uint32_t)kCAAM_AlgStateInitFinal))
    {
        HmacMode = (uint32_t)kCAAM_HmacModeNonDerivedKey;
    }
    else
    {
        HmacMode = (uint32_t)kCAAM_HmacModeDerivedKey;
    }

    /* Set CAAM algorithm */
    switch (algo)
    {
        case kCAAM_XcbcMac:
            modeReg = (uint32_t)kCAAM_AlgorithmAES | (uint32_t)kCAAM_ModeXCBCMAC;
            outSize = 16u;
            break;
        case kCAAM_Cmac:
            modeReg = (uint32_t)kCAAM_AlgorithmAES | (uint32_t)kCAAM_ModeCMAC;
            outSize = 16u;
            break;
        case kCAAM_Sha1:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA1;
            outSize = (uint32_t)kCAAM_OutLenSha1;
            break;
        case kCAAM_Sha224:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA224;
            outSize = (uint32_t)kCAAM_OutLenSha224;
            break;
        case kCAAM_Sha256:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA256;
            outSize = (uint32_t)kCAAM_OutLenSha256;
            break;
        case kCAAM_Sha384:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA384;
            outSize = (uint32_t)kCAAM_OutLenSha384;
            break;
        case kCAAM_Sha512:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA512;
            outSize = (uint32_t)kCAAM_OutLenSha512;
            break;
        case kCAAM_HmacSha1:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA1 | (uint32_t)HmacMode;
            outSize = (uint32_t)kCAAM_OutLenSha1;
            break;
        case kCAAM_HmacSha224:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA224 | (uint32_t)HmacMode;
            outSize = (uint32_t)kCAAM_OutLenSha224;
            break;
        case kCAAM_HmacSha256:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA256 | (uint32_t)HmacMode;
            outSize = (uint32_t)kCAAM_OutLenSha256;
            break;
        case kCAAM_HmacSha384:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA384 | (uint32_t)HmacMode;
            outSize = (uint32_t)kCAAM_OutLenSha384;
            break;
        case kCAAM_HmacSha512:
            modeReg = (uint32_t)kCAAM_AlgorithmSHA512 | (uint32_t)HmacMode;
            outSize = (uint32_t)kCAAM_OutLenSha512;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }

    modeReg |= algState;
    if (algOutSize != NULL)
    {
        *algOutSize = outSize;
    }

    return modeReg;
}

static uint32_t caam_hash_algo2ctx_size(caam_hash_algo_t algo, uint32_t how)
{
    uint32_t ctxSize = 0u;

    /* Size of context in bytes for context switching */
    switch (algo)
    {
        case kCAAM_XcbcMac:
            if (how == 0U)
            {
                ctxSize = 48u; /* add K3 and K2 */
            }
            else
            {
                ctxSize = 16u; /* only running or final MAC during UPDATE or FINALIZE or INITIALIZE/FINALIZE */
            }
            break;
        case kCAAM_Cmac:
            if (how == 0U)
            {
                ctxSize = 32u; /* add L */
            }
            else
            {
                ctxSize = 16u; /* only running or final MAC during UPDATE or FINALIZE or INITIALIZE/FINALIZE */
            }
            break;
        /* MDHA use of the Context Register
        The Context Register stores the current digest and running message length. The running
        message length will be 8 bytes immediately following the active digest. The digest size is
        defined as follows:
        MD5: 16 bytes
        SHA-1: 20 bytes
        SHA-224: 28 bytes final digest; 32 bytes running digest
        SHA-256: 32 bytes
        SHA-384: 48 bytes final digest; 64 bytes running digest
        SHA-512: 64 bytes */
        case kCAAM_Sha1:
            ctxSize = 28u; /* 8 + 20 */
            break;
        case kCAAM_Sha224:
        case kCAAM_Sha256:
            ctxSize = 40u; /* 8 + 32 */
            break;
        case kCAAM_Sha384:
        case kCAAM_Sha512:
            ctxSize = 72u; /* 8 + 64 */
            break;
        /* Add the context of HMAC: in Init mode the HMAC context includes the derived key
        in other cases HMAC_SHA_XXX contex's size is the same as the SHA_XXX context's size */
        case kCAAM_HmacSha1:
            if (how == 0u)
            {
                ctxSize = 76u; /* 8 + 20 + (sizeof(derivedKey) = 48)*/
            }
            else
            {
                ctxSize = 28u; /* 8 + 20 */
            }
            break;
        case kCAAM_HmacSha224:
        case kCAAM_HmacSha256:
            if (how == 0u)
            {
                ctxSize = 104u; /* 8 + 32 + (sizeof(derivedKey) = 64)*/
            }
            else
            {
                ctxSize = 40u; /* 8 + 32 */
            }
            break;
        case kCAAM_HmacSha384:
        case kCAAM_HmacSha512:
            if (how == 0u)
            {
                ctxSize = 200u; /* 8 + 64 + (sizeof(derivedKey) = 128)*/
            }
            else
            {
                ctxSize = 72u; /* 8 + 64 */
            }
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }
    return ctxSize;
}

static const uint32_t templateHash[] = {
    /* 00 */ 0xB0800000u, /* HEADER */
    /* 01 */ 0x00000000u, /* KEY */
    /* 02 */ 0x00000000u, /* place: key address */
    /* 03 */ 0x10200000u, /* LOAD bytes to Class Context Register. Offset 0 bytes. */
    /* 04 */ 0x00000000u, /* place: context address */

    /* 05 */ 0x80000000u, /* OPERATION (place either AES MAC or MDHA SHA) */
    /* 06 */ 0x21570000u, /* FIFO LOAD Class Message via SGT and EXT length */
    /* 07 */ 0x00000000u, /* place: SGT address */
    /* 08 */ 0x00000000u, /* place: FIFO LOAD EXT Length size */
    /* 09 */ 0x50200000u, /* STORE bytes from Class Context Register offset 0 bytes. */
    /* 10 */ 0x00000000u, /* place: context address */

