RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
    status = CAAM_HASH_NonBlocking(base, handle, descBuf, algo, input, inputSize, key, keySize, output, outputSize);
    if (kStatus_Success != status)
    {
        return status;
    }

    status = CAAM_Wait(base, handle, descBuf, kCAAM_Blocking);
#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)output, *outputSize);
#endif /* CAAM_OUT_INVALIDATE */
    return status;
}

/*!
 * brief Create HASH on given data
 *
 * Perform the full keyed XCBC-MAC/CMAC or SHA in one function call.
 *
 * Key shall be supplied if the underlaying algoritm is AES XCBC-MAC or CMAC.
 * Key shall be NULL if the underlaying algoritm is SHA.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For MDHA the key length argument
 * is ignored.
 *
 * The function is non-blocking. The request is scheduled at CAAM.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request.
 * param[out] descriptor Memory for the CAAM descriptor.
 * param algo Underlaying algorithm to use for hash computation.
 * param input Input data
 * param inputSize Size of input data in bytes
 * param key Input key (NULL if underlaying algorithm is SHA)
 * param keySize Size of input key in bytes
 * param[out] output Output hash data
 * param[out] outputSize Output parameter storing the size of the output hash in bytes
 * return Status of the one call hash operation.
 */
status_t CAAM_HASH_NonBlocking(CAAM_Type *base,
                               caam_handle_t *handle,
                               caam_desc_hash_t descriptor,
                               caam_hash_algo_t algo,
                               const uint8_t *input,
                               size_t inputSize,
                               const uint8_t *key,
                               size_t keySize,
                               uint8_t *output,
                               size_t *outputSize)
{
    status_t status;
    caam_algorithm_state_t algState;
    caam_hash_internal_sgt_t sgt;

    (void)memset(&sgt, 0, sizeof(sgt));

    algState     = kCAAM_AlgStateInitFinal;
    uint32_t num = caam_hash_sgt_insert(NULL,             /* no ctxInternal data to pre-pend before input data chunk */
                                        input, inputSize, /* data and size in bytes */
                                        NULL, /* all data is processed during kCAAM_AlgStateInitFinal, nothing remain */
                                        algState, sgt, kCAAM_HashSgtEntryLast); /* sgt table, entry 0 word 0 */

    /* schedule the request at CAAM */
    status = caam_hash_schedule_input_data(base, handle, algo, sgt, num, kCAAM_HashSgtInternal, algState, descriptor,
                                           outputSize, output, NULL, (uint32_t)key, keySize);
    return status;
}

/*******************************************************************************
 * HMAC
 ******************************************************************************/

/*!
 * brief Initialize HMAC context
 *
 * This function initializes the HMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For MDHA the key length argument
 * is ignored.
 *
 * This functions is used to initialize the context for both blocking and non-blocking
 * CAAM_HMAC API.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request.
 * param[out] ctx Output HMAC context
 * param algo Underlaying algorithm to use for HMAC computation.
 * param key Input key
 * param keySize Size of input key in bytes
 * return Status of initialization
 */
status_t CAAM_HMAC_Init(CAAM_Type *base,
                        caam_handle_t *handle,
                        caam_hash_ctx_t *ctx,
                        caam_hash_algo_t algo,
                        const uint8_t *key,
                        size_t keySize)
{
    return CAAM_HASH_Init(base, handle, ctx, algo, key, keySize);
}

/*!
 * brief Create Message Authentication Code (MAC) on given data
 *
 * Perform the full keyed XCBC-MAC/CMAC, or HMAC-SHA in one function call.
 *
 * Key shall be supplied if the underlaying algoritm is AES XCBC-MAC, CMAC, or SHA HMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For HMAC, the key can have
 * any size.
 *
 * The function is blocking.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request.
 * param algo Underlaying algorithm to use for MAC computation.
 * param input Input data
 * param inputSize Size of input data in bytes
 * param key Input key
 * param keySize Size of input key in bytes
 * param[out] output Output MAC data
 * param[out] outputSize Output parameter storing the size of the output MAC in bytes
 * return Status of the one call hash operation.
 */
status_t CAAM_HMAC(CAAM_Type *base,
                   caam_handle_t *handle,
                   caam_hash_algo_t algo,
                   const uint8_t *input,
                   size_t inputSize,
                   const uint8_t *key,
                   size_t keySize,
                   uint8_t *output,
                   size_t *outputSize)
{
    status_t status;
    /* Dummy HASH context for input checking */
    caam_hash_ctx_t ctxDummy;

    if (!caam_hash_alg_is_hmac(algo))
    {
        /* Not an HMAC algorithm */
        return kStatus_InvalidArgument;
    }

    status = caam_hash_check_input_args(base, &ctxDummy, algo, key, keySize);
    if (kStatus_Success != status)
    {
        return status;
    }

    /* Make space for the largest possible key size */
    uint8_t updatedKey[CAAM_SHA_BLOCK_SIZE] = {0};
    size_t updatedKeySize                   = 0;

    (void)memset(updatedKey, 0, sizeof(updatedKey));

    status = hmac_prehash_key(base, handle, algo, key, keySize, updatedKey, &updatedKeySize);
    if (kStatus_Success != status)
    {
        return status;
    }

    status = CAAM_HASH(base, handle, algo, input, inputSize, updatedKey, updatedKeySize, output, outputSize);
    return status;
}

/*!
 * brief Create Message Authentication Code (MAC) on given data
 *
 * Perform the full keyed XCBC-MAC/CMAC, or HMAC-SHA in one function call.
 *
 * Key shall be supplied if the underlaying algoritm is AES XCBC-MAC, CMAC, or SHA HMAC.
 *
 * For XCBC-MAC, the key length must be 16. For CMAC, the key length can be
 * the AES key lengths supported by AES engine. For HMAC, the key can have
 * any size, however the function will block if the supplied key is bigger than
 * the block size of the underlying hashing algorithm (e.g. >64 bytes for SHA256).
 *
 * The function is not blocking with the exception of supplying large key sizes.
 * In that case the function will block until the large key is hashed down with the
 * supplied hashing algorithm (as per FIPS 198-1), after which operation is resumed
 * to calling non-blocking HMAC.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request.
 * param algo Underlaying algorithm to use for MAC computation.
 * param input Input data
 * param inputSize Size of input data in bytes
 * param key Input key
 * param keySize Size of input key in bytes
 * param[out] output Output MAC data
 * param[out] outputSize Output parameter storing the size of the output MAC in bytes
 * return Status of the one call hash operation.
 */
status_t CAAM_HMAC_NonBlocking(CAAM_Type *base,
                               caam_handle_t *handle,
                               caam_desc_hash_t descriptor,
                               caam_hash_algo_t algo,
                               const uint8_t *input,
                               size_t inputSize,
                               const uint8_t *key,
                               size_t keySize,
                               uint8_t *output,
                               size_t *outputSize)
{
    status_t status;
    /* Dummy HASH context for input checking */
    caam_hash_ctx_t ctxDummy;

