RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
    /* CRC is Class 2 CHA */

    /* add class to all commands that need it */
    descriptor[1] |= 0x04000000u;
    descriptor[3] |= 0x04000000u;
    descriptor[5] |= 0x04000000u;
    descriptor[6] |= 0x04000000u;
    descriptor[9] |= 0x04000000u;
    descriptor[11] |= 0x04000000u;

    /* add descriptor size */
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);

    /* kCAAM_AlgStateInit or kCAAM_AlgStateInitFinal needs to skip context load as there is no context */
    if ((algState == kCAAM_AlgStateInit) || (algState == kCAAM_AlgStateInitFinal))
    {
        if (!isCustomCRC)
        {
            /* HEADER can jump directly to MDHA operation */
            descriptor[0] |= 0x00050000U; /* JUMP to descriptor[5] */
        }
        else
        {
            /* load Polynomial, then directly to CRC operation */
            descriptor[1] |= (polynomialSize & DESC_KEY_SIZE_MASK);
            descriptor[2] = ADD_OFFSET(polynomialAddr);
            descriptor[3] = DESC_JUMP_2; /* JUMP to descriptor[5] */
        }
    }
    else
    {
        if (!isCustomCRC)
        {
            /* CRC without custom polynomial in Update state skips loading the Polynomial
             * HEADER can jump directly to context restore
             */
            descriptor[0] |= 0x00030000U; /* JUMP to descriptor[3] */
        }
        else
        {
            /* load Polynomial */
            descriptor[1] |= (polynomialSize & DESC_KEY_SIZE_MASK);
            descriptor[2] = ADD_OFFSET(polynomialAddr);
        }

        /* context restore */
        descriptor[3] |= caamCtxSz;
        descriptor[4] = ADD_OFFSET((uint32_t)(uint32_t *)context);
    }

    /* OPERATION:
     * alg MDHA
     * mode INITIALIZE or UPDATE or FINALIZE or INITIALIZE/FINALIZE in algState argument
     */

    /* ALGORITHM OPERATION | CLASS | alg | aai | algState */
    descriptor[5] |= caam_crc_algo2mode(algo, (uint32_t)crcMode, (uint32_t)algState << 2);

    /* configure SGT */
    descriptor[8] = dataSize;
    if (kCAAM_HashSgtInternal == sgtType)
    {
        descriptor[7] = ADD_OFFSET(
            (uint32_t)&descriptor[(uint32_t)kCAAM_HashDescriptorSgtIdx]); /* use SGT embedded in the job descriptor */
        (void)caam_memcpy(&descriptor[(uint32_t)kCAAM_HashDescriptorSgtIdx], (const uint32_t *)(uintptr_t)sgt,
                          sizeof(caam_hash_internal_sgt_t));
    }
    else
    {
        descriptor[7] = ADD_OFFSET((uint32_t)sgt);
    }

    /* save context: context switch init or running or result */
    if ((kCAAM_AlgStateFinal == algState) || (kCAAM_AlgStateInitFinal == algState))
    {
        if (outputSize != NULL)
        {
            if (algOutSize < *outputSize)
            {
                *outputSize = algOutSize;
            }
            else
            {
                algOutSize = *outputSize;
            }
        }
        caamCtxSz = algOutSize;
    }
    else
    {
        caamCtxSz = 12u;
    }
    descriptor[9] |= caamCtxSz;
    if ((kCAAM_AlgStateFinal == algState) || (kCAAM_AlgStateInitFinal == algState))
    {
        /* final result write to output */
        descriptor[10] = ADD_OFFSET((uint32_t)(uint32_t *)output);
    }
    else
    {
        /* context switch write to ctxInternal */
        descriptor[10] = ADD_OFFSET((uint32_t)(uint32_t *)context);
    }

    descriptor[11] = ADD_OFFSET(descriptor[13]); /* always halt with status 0x0 (normal) */

    return caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
}

/*!
 * @brief Add uncomplete block (ctxInternal), then append new data (to current crc calculation).
 *
 *
 */
static status_t caam_crc_append_data(caam_crc_ctx_internal_t *ctxInternal,
                                     const uint8_t *input,
                                     size_t inputSize,
                                     caam_algorithm_state_t algState,
                                     caam_desc_hash_t descriptor,
                                     size_t *numRemain,
                                     void *output,
                                     size_t *outputSize)
{
    caam_hash_internal_sgt_t sgt;
    (void)memset(&sgt, 0, sizeof(sgt));
    size_t num = caam_crc_sgt_insert(ctxInternal, input, inputSize, numRemain, algState, sgt, kCAAM_HashSgtEntryLast);
    return caam_crc_schedule_input_data(ctxInternal->base, ctxInternal->handle, ctxInternal->algo, ctxInternal->crcmode,
                                        sgt, num, kCAAM_HashSgtInternal, algState, descriptor, outputSize, output,
                                        &ctxInternal->word[0], (uint32_t)&ctxInternal->word[kCAAM_HashCtxKeyStartIdx],
                                        ctxInternal->word[kCAAM_HashCtxKeySize]);
}

/*******************************************************************************
 * CRC Code public
 ******************************************************************************/

/*!
 * brief Initialize CRC context
 *
 * This function initializes the CRC context.
 * polynomial shall be supplied if the underlaying algoritm is kCAAM_CrcCUSTPOLY.
 * polynomial shall be NULL if the underlaying algoritm is kCAAM_CrcIEEE or kCAAM_CrciSCSI.
 *
 * This functions is used to initialize the context for CAAM_CRC API
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request.
 * param[out] ctx Output crc context
 * param algo Underlaying algorithm to use for CRC computation
 * param polynomial CRC polynomial (NULL if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI)
 * param polynomialSize Size of polynomial in bytes (0u if underlaying algorithm is kCAAM_CrcIEEE or kCAAM_CrciSCSI)
 * param mode Specify how CRC engine manipulates its input and output data
 * return Status of initialization
 */
status_t CAAM_CRC_Init(CAAM_Type *base,
                       caam_handle_t *handle,
                       caam_crc_ctx_t *ctx,
                       caam_crc_algo_t algo,
                       const uint8_t *polynomial,
                       size_t polynomialSize,
                       caam_aai_crc_alg_t mode)
{
    status_t ret = kStatus_Fail;
    caam_crc_ctx_internal_t *ctxInternal;
    uint32_t i;

