RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
size_t CAAM_ECC_PrivateKeySize(caam_ecc_encryption_type_t encryptKeyType, caam_ecc_ecdsel_t ecdsel)
{
    size_t output = CAAM_ECC_PRIVATE_KEY_LENGTH(ecdsel);

    switch (encryptKeyType)
    {
        case kCAAM_Ecc_Encryption_Type_Ecb_Jkek:
        {
            output = CAAM_BLACKEN_ECB_SIZE(output);
            break;
        }
        case kCAAM_Ecc_Encryption_Type_Ccm_Jkek:
        {
            output = CAAM_BLACKEN_CCM_SIZE(output);
            break;
        }
        default:
        {
            break;
        }
    }

    return output;
}

static const uint32_t templateEccKeyPair[] = {
    /* 00 */ 0xB0840000u, /* HEADER */
    /* 01 */ 0x02000000u, /* ECC domain */
    /* 02 */ 0x00000000u, /* s */
    /* 03 */ 0x00000000u, /* Wx,y */
    /* 04 */ 0x80000002u, /* operation */
};

/*!
 * brief Generates public and private key for ECC.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param ecdsel Elliptic curve domain selection
 * param encryptKeyType Type of key encryption
 * param[out] privKey Private key
 * param[out] pubKey Public key
 * return Operation status.
 */
status_t CAAM_ECC_KeyPair(CAAM_Type *base,
                          caam_handle_t *handle,
                          caam_ecc_ecdsel_t ecdsel,
                          caam_ecc_encryption_type_t encryptKeyType,
                          uint8_t *privKey,
                          uint8_t *pubKey)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateEccKeyPair);

    (void)caam_memcpy(descriptor, templateEccKeyPair, sizeof(templateEccKeyPair));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= (((uint32_t)ecdsel) & 0x7Fu) << 7;
    descriptor[2] |= ADD_OFFSET((uint32_t)privKey);
    descriptor[3] |= ADD_OFFSET((uint32_t)pubKey);
    descriptor[4] |= (0x14UL << 16) | ((uint32_t)encryptKeyType) | CAAM_ECC_DomainBit(ecdsel);

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)privKey, CAAM_ECC_PrivateKeySize(encryptKeyType, ecdsel));
    DCACHE_InvalidateByRange((uint32_t)pubKey, CAAM_ECC_PUBLIC_KEY_LENGTH(ecdsel));
#endif /* CAAM_OUT_INVALIDATE */

    return status;
}

static const uint32_t templateEccSign[] = {
    /* 00 */ 0xB0870000u, /* HEADER */
    /* 01 */ 0x00400000u, /* ECC domain */
    /* 02 */ 0x00000000u, /* s */
    /* 03 */ 0x00000000u, /* f */
    /* 04 */ 0x00000000u, /* c */
    /* 05 */ 0x00000000u, /* d */
    /* 06 */ 0x00000000u, /* ml */
    /* 07 */ 0x80000802u, /* operation */
};

/*!
 * brief Generates signature using ECC.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param privKey Private key
 * param data Hashed data
 * param dataSize Hashed data length
 * param ecdsel Elliptic curve domain selection
 * param encryptKeyType Type of key encryption
 * param[out] signFirst First part of the signature
 * param[out] signSecond Second part of the signature
 * return Operation status.
 */
status_t CAAM_ECC_Sign(CAAM_Type *base,
                       caam_handle_t *handle,
                       const uint8_t *privKey,
                       const uint8_t *data,
                       size_t dataSize,
                       caam_ecc_ecdsel_t ecdsel,
                       caam_ecc_encryption_type_t encryptKeyType,
                       uint8_t *signFirst,
                       uint8_t *signSecond)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateEccSign);

    (void)caam_memcpy(descriptor, templateEccSign, sizeof(templateEccSign));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= (((uint32_t)ecdsel) & 0x7Fu) << 7;
    descriptor[2] |= ADD_OFFSET((uint32_t)privKey);
    descriptor[3] |= ADD_OFFSET((uint32_t)data);
    descriptor[4] |= ADD_OFFSET((uint32_t)signFirst);
    descriptor[5] |= ADD_OFFSET((uint32_t)signSecond);
    descriptor[6] = dataSize;
    descriptor[7] |= (0x15UL << 16) | ((uint32_t)encryptKeyType) | CAAM_ECC_DomainBit(ecdsel);

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)signFirst, CAAM_ECC_PRIVATE_KEY_LENGTH(ecdsel));
    DCACHE_InvalidateByRange((uint32_t)signSecond, CAAM_ECC_SECOND_SIGN_BUFFER_SIZE(ecdsel));
#endif /* CAAM_OUT_INVALIDATE */

    return status;
}

static const uint32_t templateEccVerifyPublic[] = {
    /* 00 */ 0xB0880000u, /* HEADER */
    /* 01 */ 0x00400000u, /* ECC domain */
    /* 02 */ 0x00000000u, /* Wx,y */
    /* 03 */ 0x00000000u, /* f */
    /* 04 */ 0x00000000u, /* c */
    /* 05 */ 0x00000000u, /* d */
    /* 06 */ 0x00000000u, /* tmp */
    /* 07 */ 0x00000000u, /* ml */
    /* 08 */ 0x80000802u, /* operation */
};

/*!
 * brief Verify ECC signature using public key
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param pubKey Public key
 * param data Hashed data
 * param dataSize Hashed data length
 * param signFirst First part of the signature
 * param signSecond Second part of the signature
 * param ecdsel Elliptic curve domain selection
 * param[in,out] tmp Temporary storage for intermediate results
 * return Operation status.
 */
status_t CAAM_ECC_VerifyPublicKey(CAAM_Type *base,
                                  caam_handle_t *handle,
                                  const uint8_t *pubKey,
                                  const uint8_t *data,
                                  size_t dataSize,
                                  const uint8_t *signFirst,
                                  const uint8_t *signSecond,
                                  caam_ecc_ecdsel_t ecdsel,
                                  uint8_t *tmp)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateEccVerifyPublic);

