RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
    (void)caam_memcpy(descriptor, templateEccVerifyPublic, sizeof(templateEccVerifyPublic));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= (((uint32_t)ecdsel) & 0x7Fu) << 7;
    descriptor[2] |= ADD_OFFSET((uint32_t)pubKey);
    descriptor[3] |= ADD_OFFSET((uint32_t)data);
    descriptor[4] |= ADD_OFFSET((uint32_t)signFirst);
    descriptor[5] |= ADD_OFFSET((uint32_t)signSecond);
    descriptor[6] |= ADD_OFFSET((uint32_t)tmp);
    descriptor[7] = dataSize;
    descriptor[8] |= (0x16UL << 16) | CAAM_ECC_DomainBit(ecdsel);

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)tmp, CAAM_ECC_PUBLIC_KEY_LENGTH(ecdsel));
#endif /* CAAM_OUT_INVALIDATE */

    return status;
}

static const uint32_t templateEccVerifyPrivate[] = {
    /* 00 */ 0xB0870000u, /* HEADER */
    /* 01 */ 0x00400000u, /* ECC domain */
    /* 02 */ 0x00000000u, /* Wx,y */
    /* 03 */ 0x00000000u, /* f */
    /* 04 */ 0x00000000u, /* c */
    /* 05 */ 0x00000000u, /* d */
    /* 06 */ 0x00000000u, /* ml */
    /* 07 */ 0x80000802u, /* operation */
};

/*!
 * brief Verify ECC signature using private key
 *
 * Faster that verifying using public key.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param privKey Private key
 * param data Hashed data
 * param dataSize Hashed data length
 * param signFirst First part of the signature
 * param signSecond Second part of the signature
 * param ecdsel Elliptic curve domain selection
 * param encryptKeyType Type of key encryption
 * return Operation status.
 */
status_t CAAM_ECC_VerifyPrivateKey(CAAM_Type *base,
                                   caam_handle_t *handle,
                                   const uint8_t *privKey,
                                   const uint8_t *data,
                                   size_t dataSize,
                                   const uint8_t *signFirst,
                                   const uint8_t *signSecond,
                                   caam_ecc_ecdsel_t ecdsel,
                                   caam_ecc_encryption_type_t encryptKeyType)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateEccVerifyPrivate);

    (void)caam_memcpy(descriptor, templateEccVerifyPrivate, sizeof(templateEccVerifyPrivate));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= (((uint32_t)ecdsel) & 0x7Fu) << 7;
    descriptor[2] |= ADD_OFFSET((uint32_t)privKey);
    descriptor[3] |= ADD_OFFSET((uint32_t)data);
    descriptor[4] |= ADD_OFFSET((uint32_t)signFirst);
    descriptor[5] |= ADD_OFFSET((uint32_t)signSecond);
    descriptor[6] = dataSize;
    descriptor[7] |= (0x12UL << 16) | ((uint32_t)encryptKeyType) | CAAM_ECC_DomainBit(ecdsel);

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

    return status;
}

/*******************************************************************************
 * RSA
 ******************************************************************************/

size_t CAAM_RSA_PrivateExponentSize(caam_rsa_key_type_t prvKeyType, uint32_t privExponentSize)
{
    size_t output = privExponentSize;

    switch (prvKeyType)
    {
        case kCAAM_Rsa_Key_Type_Ecb_Jkek:
        {
            output = CAAM_BLACKEN_ECB_SIZE(output);
            break;
        }
        case kCAAM_Rsa_Key_Type_Ccm_Jkek:
        {
            output = CAAM_BLACKEN_CCM_SIZE(output);
            break;
        }
        default:
        {
            break;
        }
    }

    return output;
}

static const uint32_t templateRsaKeyPair[] = {
    /* 00 */ 0xB08A0000u, /* HEADER */
    /* 01 */ 0x00000000u, /* */
    /* 02 */ 0x00000000u, /* #p */
    /* 03 */ 0x00000000u, /* #n size #e size */
    /* 04 */ 0x00000000u, /* p */
    /* 05 */ 0x00000000u, /* q */
    /* 06 */ 0x00000000u, /* e */
    /* 07 */ 0x00000000u, /* n */
    /* 08 */ 0x00000000u, /* d */
    /* 09 */ 0x00000000u, /* d size */
    /* 10 */ 0x801A0082u, /* OPERATION: RSA Keygen */
};

status_t CAAM_RSA_KeyPair(CAAM_Type *base,
                          caam_handle_t *handle,
                          const uint8_t *primeP,
                          const uint8_t *primeQ,
                          uint32_t primesSize,
                          const uint8_t *pubExponent,
                          uint32_t pubExponentSize,
                          caam_rsa_key_type_t prvKeyType,
                          uint8_t *modulus,
                          uint32_t modulusSize,
                          uint8_t *privExponent,
                          size_t *privExponentSize)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateRsaKeyPair);

    (void)caam_memcpy(descriptor, templateRsaKeyPair, sizeof(templateRsaKeyPair));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    // descriptor[1] |=; // reserved
    descriptor[2] |= primesSize & 0x1FFu;
    descriptor[3] |= ((modulusSize & 0x3FFu) << 16) | (pubExponentSize & 0x3FFu);
    descriptor[4] |= ADD_OFFSET((uint32_t)primeP);
    descriptor[5] |= ADD_OFFSET((uint32_t)primeQ);
    descriptor[6] |= ADD_OFFSET((uint32_t)pubExponent);
    descriptor[7] |= ADD_OFFSET((uint32_t)modulus);
    descriptor[8] |= ADD_OFFSET((uint32_t)privExponent);
    descriptor[9] |= ADD_OFFSET((uint32_t)privExponentSize);
    descriptor[10] |= (uint32_t)prvKeyType;

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)modulus, modulusSize);
    DCACHE_InvalidateByRange((uint32_t)privExponentSize, sizeof(*privExponentSize));
    DCACHE_InvalidateByRange((uint32_t)privExponent, *privExponentSize);
#endif /* CAAM_OUT_INVALIDATE */

