RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_caam.c
    return status;
}

static const uint32_t templateRsaEncrypt[] = {
    /* 00 */ 0xB0870000u, /* HEADER */
    /* 01 */ 0x00000000u, /* #e size #n size */
    /* 02 */ 0x00000000u, /* f */
    /* 03 */ 0x00000000u, /* g */
    /* 04 */ 0x00000000u, /* n */
    /* 05 */ 0x00000000u, /* e */
    /* 06 */ 0x00000000u, /* #f*/
    /* 07 */ 0x80180000u, /* OPERATION: RSA Encrrypt */
};

status_t CAAM_RSA_Encrypt(CAAM_Type *base,
                          caam_handle_t *handle,
                          const uint8_t *plainText,
                          uint32_t plainTextSize,
                          const uint8_t *modulus,
                          uint32_t modulusSize,
                          const uint8_t *pubExponent,
                          uint32_t pubExponentSize,
                          caam_rsa_encryption_type_t dataOutType,
                          caam_rsa_format_type_t format,
                          uint8_t *cipherText)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateRsaEncrypt);

    (void)caam_memcpy(descriptor, templateRsaEncrypt, sizeof(templateRsaEncrypt));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= ((pubExponentSize & 0xFFFu) << 12) | (modulusSize & 0xFFFu);
    descriptor[2] |= ADD_OFFSET((uint32_t)plainText);
    descriptor[3] |= ADD_OFFSET((uint32_t)cipherText);
    descriptor[4] |= ADD_OFFSET((uint32_t)modulus);
    descriptor[5] |= ADD_OFFSET((uint32_t)pubExponent);
    descriptor[6] |= plainTextSize & 0xFFFu;
    descriptor[7] |= (((uint32_t)dataOutType) << 4) | (((uint32_t)format) << 12);

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)cipherText, modulusSize);
#endif /* CAAM_OUT_INVALIDATE */

    return status;
}

static const uint32_t templateRsaDecrypt[] = {
    /* 00 */ 0xB0860000u, /* HEADER */
    /* 01 */ 0x00000000u, /* #d size #n size */
    /* 02 */ 0x00000000u, /* g */
    /* 03 */ 0x00000000u, /* f */
    /* 04 */ 0x00000000u, /* n */
    /* 05 */ 0x00000000u, /* d */
    /* 06 */ 0x80190000u, /* OPERATION: Decrypt */
    /* 07 */ 0x56080404u, /* store math0 in rsaDecSize */
    /* 08 */ 0x00000000u, /* rsaDecSize address */
};

status_t CAAM_RSA_Decrypt(CAAM_Type *base,
                          caam_handle_t *handle,
                          const uint8_t *cipherText,
                          const uint8_t *modulus,
                          uint32_t modulusSize,
                          const uint8_t *privExponent,
                          uint32_t privExponentSize,
                          caam_rsa_encryption_type_t prvKeyType,
                          caam_rsa_encryption_type_t dataOutType,
                          caam_rsa_format_type_t format,
                          uint8_t *plainText,
                          size_t *rsaDecSize)
{
    caam_desc_rsa_t descriptor;
    uint32_t descriptorSize = ARRAY_SIZE(templateRsaDecrypt);
    *rsaDecSize             = 0;

    (void)caam_memcpy(descriptor, templateRsaDecrypt, sizeof(templateRsaDecrypt));

    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
    descriptor[1] |= ((privExponentSize & 0xFFFu) << 12) | (modulusSize & 0xFFFu);
    descriptor[2] |= ADD_OFFSET((uint32_t)cipherText);
    descriptor[3] |= ADD_OFFSET((uint32_t)plainText);
    descriptor[4] |= ADD_OFFSET((uint32_t)modulus);
    descriptor[5] |= ADD_OFFSET((uint32_t)privExponent);
    descriptor[6] |= (((uint32_t)prvKeyType) << 8) | (((uint32_t)dataOutType) << 4) | (((uint32_t)format) << 12);
    descriptor[8] = ADD_OFFSET((uint32_t)rsaDecSize); /* place: tag address */

    status_t status = caam_in_job_ring_add_and_wait(base, handle, descriptor, kCAAM_Blocking);

#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)rsaDecSize, sizeof(*rsaDecSize));
    DCACHE_InvalidateByRange((uint32_t)plainText, *rsaDecSize);
#endif /* CAAM_OUT_INVALIDATE */

    return status;
}